Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/gitlab.tmx
Source language: en
Languages: sv

source: DeployTokens|Allows read, write, and delete access to container images through the dependency proxy.
sv: DeployTokens|Tillåter läs-, skriv- och raderingsåtkomst till containeravbildningar via beroendeproxyn.

source: DeployTokens|Allows read-only access to container images through the dependency proxy.
sv: DeployTokens|Tillåter skrivskyddad åtkomst till containeravbildningar via beroendeproxyn.

source: ServiceAccounts|An error occurred creating the service account.
sv: ServiceAccounts|Ett fel uppstod när tjänstekontot skulle skapas.

source: ServiceAccounts|An error occurred updating the service account.
sv: ServiceAccounts|Ett fel uppstod när tjänstekontot skulle uppdateras.

source: ServiceAccounts|The service account was created.
sv: ServiceAccounts|Tjänstekontot skapades.

source: ServiceAccounts|The service account was updated.
sv: ServiceAccounts|Tjänstekontot uppdaterades.

source: ComplianceFrameworks|Secret token is required
sv: ComplianceFrameworks|Hemlig token krävs

source: ComplianceStandardsAdherence|%{failedCount}/%{totalCount} failed
sv: ComplianceStandardsAdherence|%{failedCount}/%{totalCount} misslyckades

source: ComplianceStandardsAdherence|Last scanned
sv: ComplianceStandardsAdherence|Senast skannad

source: ComplianceStandardsAdherence|Passed
sv: ComplianceStandardsAdherence|Godkänd

source: ComplianceStandardsAdherence|Requirements
sv: ComplianceStandardsAdherence|Krav

source: ComplianceStandardsAdherence|Configure DAST scanning
sv: ComplianceStandardsAdherence|Konfigurera DAST-skanning

source: ComplianceStandardsAdherence|Configure approval requirements
sv: ComplianceStandardsAdherence|Konfigurera godkännandekrav

source: ComplianceStandardsAdherence|Enable code quality scanning
sv: ComplianceStandardsAdherence|Aktivera kodkvalitetsskanning

source: ComplianceStandardsAdherence|Enable dependency scanning
sv: ComplianceStandardsAdherence|Aktivera beroendeskanning

source: ComplianceStandardsAdherence|Implement secret detection
sv: ComplianceStandardsAdherence|Inför hemlighetsidentifiering

source: ComplianceStandardsAdherence|Set up branch protection
sv: ComplianceStandardsAdherence|Konfigurera grenskydd

source: ComplianceStandardsAdherence|Set up container scanning
sv: ComplianceStandardsAdherence|Konfigurera containerskanning

source: CICD| Incremental logging configuration
sv: CICD|Konfiguration för stegvis loggning

source: CICD|Configure CI job log settings for all projects.
sv: CICD|Konfigurera logginställningar för CI-jobb för alla projekt.

source: CI/CD job token
sv: CI/CD-jobbtoken

source: CI/CD pipeline configuration
sv: CI/CD-pipelinekonfiguration

source: ComplianceStandardsAdherence|Add adequate administrators
sv: ComplianceStandardsAdherence|Lägg till tillräckligt många administratörer

source: ComplianceStandardsAdherence|Add multiple administrators
sv: ComplianceStandardsAdherence|Lägg till flera administratörer

source: ComplianceStandardsAdherence|Adjust permissions to control who can merge changes to the default branch.
sv: ComplianceStandardsAdherence|Justera behörigheter för att styra vem som kan sammanfoga ändringar till standardgrenen.

source: ComplianceStandardsAdherence|Adjust permissions to control who can push directly to the default branch.
sv: ComplianceStandardsAdherence|Justera behörigheter för att styra vem som kan skicka upp direkt till standardgrenen.

source: ComplianceStandardsAdherence|Configure Infrastructure as Code scanning to detect misconfigurations before deployment.
sv: ComplianceStandardsAdherence|Konfigurera skanning av infrastruktur som kod för att upptäcka felkonfigurationer före driftsättning.

source: ComplianceStandardsAdherence|Configure SAST scanning
sv: ComplianceStandardsAdherence|Konfigurera SAST-skanning

source: ComplianceStandardsAdherence|Configure access controls to limit who can access build artifacts and outputs.
sv: ComplianceStandardsAdherence|Konfigurera åtkomstkontroller för att begränsa vem som kan komma åt byggartefakter och utdata.

source: ComplianceStandardsAdherence|Configure access restrictions
sv: ComplianceStandardsAdherence|Konfigurera åtkomstbegränsningar

source: ComplianceStandardsAdherence|Configure branch protection to prevent accidental or unauthorized branch deletion.
sv: ComplianceStandardsAdherence|Konfigurera grenskydd för att förhindra oavsiktlig eller obehörig borttagning av grenar.

source: ComplianceStandardsAdherence|Configure your project to require all discussions be resolved before merging.
sv: ComplianceStandardsAdherence|Konfigurera projektet så att alla diskussioner måste vara lösta före sammanfogning.

source: ComplianceStandardsAdherence|Configure your project to reset approvals when new changes are pushed.
sv: ComplianceStandardsAdherence|Konfigurera projektet så att godkännanden återställs när nya ändringar skickas upp.

source: ComplianceStandardsAdherence|Controls whether users can merge changes to the default branch.
sv: ComplianceStandardsAdherence|Styr om användare kan sammanfoga ändringar till standardgrenen.

source: ComplianceStandardsAdherence|Controls whether users can push directly to the default branch.
sv: ComplianceStandardsAdherence|Styr om användare kan skicka upp direkt till standardgrenen.

source: ComplianceStandardsAdherence|Create valid CI configuration
sv: ComplianceStandardsAdherence|Skapa giltig CI-konfiguration

source: ComplianceStandardsAdherence|Disable branch deletion
sv: ComplianceStandardsAdherence|Inaktivera borttagning av grenar

source: ComplianceStandardsAdherence|Disable force pushing
sv: ComplianceStandardsAdherence|Inaktivera framtvingade uppskick

source: ComplianceStandardsAdherence|Enable Terraform integration
sv: ComplianceStandardsAdherence|Aktivera Terraform-integrering

source: ComplianceStandardsAdherence|Enable approval reset on commit
sv: ComplianceStandardsAdherence|Aktivera återställning av godkännanden vid incheckning

source: ComplianceStandardsAdherence|Enable branch protection
sv: ComplianceStandardsAdherence|Aktivera grenskydd

source: ComplianceStandardsAdherence|Enable code quality scanning to improve code maintainability and reduce technical debt.
sv: ComplianceStandardsAdherence|Aktivera kodkvalitetsskanning för att förbättra kodens underhållbarhet och minska den tekniska skulden.

source: ComplianceStandardsAdherence|Enable dependency scanning to automatically detect vulnerable libraries in your application.
sv: ComplianceStandardsAdherence|Aktivera beroendeskanning för att automatiskt upptäcka sårbara bibliotek i programmet.

source: ComplianceStandardsAdherence|Enable error tracking
sv: ComplianceStandardsAdherence|Aktivera felspårning

source: ComplianceStandardsAdherence|Enable issue tracking
sv: ComplianceStandardsAdherence|Aktivera ärendespårning

source: ComplianceStandardsAdherence|Enable license compliance scanning
sv: ComplianceStandardsAdherence|Aktivera licensgranskning

source: ComplianceStandardsAdherence|Enable organization-wide MFA
sv: ComplianceStandardsAdherence|Aktivera MFA för hela organisationen

source: ComplianceStandardsAdherence|Ensures inactive users are reviewed and removed.
sv: ComplianceStandardsAdherence|Säkerställer att inaktiva användare granskas och tas bort.

source: ComplianceStandardsAdherence|Ensures issue tracking functionality is enabled for the project.
sv: ComplianceStandardsAdherence|Säkerställer att ärendespårning är aktiverad för projektet.

source: ComplianceStandardsAdherence|Ensures merge requests require approval from code owners.
sv: ComplianceStandardsAdherence|Säkerställer att sammanfogningsbegäranden kräver godkännande från kodägare.

source: ComplianceStandardsAdherence|Ensures new commits to merge requests reset approvals.
sv: ComplianceStandardsAdherence|Säkerställer att nya incheckningar i sammanfogningsbegäranden återställer godkännanden.

source: ComplianceStandardsAdherence|Ensures project pipelines are not publicly visible.
sv: ComplianceStandardsAdherence|Säkerställer att projektpipelines inte är offentligt synliga.

source: ComplianceStandardsAdherence|Ensures projects are not set to internal visibility.
sv: ComplianceStandardsAdherence|Säkerställer att projekt inte har intern synlighet.

source: ComplianceStandardsAdherence|Ensures projects are not set to public visibility.
sv: ComplianceStandardsAdherence|Säkerställer att projekt inte har offentlig synlighet.

source: ComplianceStandardsAdherence|Ensures push protection is enabled for sensitive files.
sv: ComplianceStandardsAdherence|Säkerställer att pushskydd är aktiverat för känsliga filer.

source: ComplianceStandardsAdherence|Ensures stale repositories are reviewed and archived.
sv: ComplianceStandardsAdherence|Säkerställer att inaktuella arkiv granskas och arkiveras.

source: ComplianceStandardsAdherence|Ensures status checks must pass before merging is allowed.
sv: ComplianceStandardsAdherence|Säkerställer att statuskontroller måste godkännas innan sammanfogning tillåts.

source: ComplianceStandardsAdherence|Ensures strict permissions are set for repository access.
sv: ComplianceStandardsAdherence|Säkerställer att strikta behörigheter är angivna för åtkomst till arkivet.

source: ComplianceStandardsAdherence|Ensures that merge requests require at least two approvals before merging.
sv: ComplianceStandardsAdherence|Säkerställer att sammanfogningsbegäranden kräver minst två godkännanden före sammanfogning.

source: ComplianceStandardsAdherence|Ensures that the author of a merge request cannot approve their own changes.
sv: ComplianceStandardsAdherence|Säkerställer att författaren till en sammanfogningsbegäran inte kan godkänna sina egna ändringar.

source: ComplianceStandardsAdherence|Ensures the GitLab instance is using an Ultimate license level.
sv: ComplianceStandardsAdherence|Säkerställer att GitLab-instansen använder Ultimate-licensnivån.

source: ComplianceStandardsAdherence|Ensures the default branch has protection rules enabled.
sv: ComplianceStandardsAdherence|Säkerställer att standardgrenen har aktiverade skyddsregler.

source: ComplianceStandardsAdherence|Implement secret detection scanning in your CI/CD pipeline to identify and remove exposed credentials.
sv: ComplianceStandardsAdherence|Inför hemlighetsidentifiering i CI/CD-pipelinen för att identifiera och ta bort exponerade autentiseringsuppgifter.

source: ComplianceStandardsAdherence|Implement user review process
sv: ComplianceStandardsAdherence|Inför en process för användargranskning

source: ComplianceStandardsAdherence|Lock approval rules
sv: ComplianceStandardsAdherence|Lås godkännanderegler

source: ComplianceStandardsAdherence|Require code owner approval
sv: ComplianceStandardsAdherence|Kräv godkännande från kodägare

source: ComplianceStandardsAdherence|Require resolved discussions
sv: ComplianceStandardsAdherence|Kräv lösta diskussioner

source: ComplianceStandardsAdherence|Restrict pipeline access
sv: ComplianceStandardsAdherence|Begränsa pipelineåtkomst

source: ComplianceStandardsAdherence|Restrict pipeline visibility
sv: ComplianceStandardsAdherence|Begränsa pipelinesynlighet

source: ComplianceStandardsAdherence|Set up SAST in your CI/CD pipeline to automatically detect code vulnerabilities.
sv: ComplianceStandardsAdherence|Konfigurera SAST i CI/CD-pipelinen för att automatiskt upptäcka kodsårbarheter.

source: ComplianceStandardsAdherence|Set up Service Level Objectives for addressing identified vulnerabilities within defined timeframes.
sv: ComplianceStandardsAdherence|Konfigurera tjänstenivåmål för att åtgärda identifierade sårbarheter inom angivna tidsramar.

source: ComplianceStandardsAdherence|Set up Terraform integration for your project to manage infrastructure as code.
sv: ComplianceStandardsAdherence|Konfigurera Terraform-integrering för projektet för att hantera infrastruktur som kod.

source: ComplianceStandardsAdherence|Set up a properly configured CI/CD pipeline for your project.
sv: ComplianceStandardsAdherence|Konfigurera en korrekt inställd CI/CD-pipeline för projektet.

source: ComplianceStandardsAdherence|Set up a status page to communicate project availability and incidents.
sv: ComplianceStandardsAdherence|Konfigurera en statussida för att kommunicera projektets tillgänglighet och incidenter.

source: ComplianceStandardsAdherence|Set up automatic cleanup of stale branches to maintain repository hygiene.
sv: ComplianceStandardsAdherence|Konfigurera automatisk rensning av inaktuella grenar för att hålla arkivet välordnat.

source: ComplianceStandardsAdherence|Set up branch protection rules for your default branch to enforce quality standards.
sv: ComplianceStandardsAdherence|Konfigurera skyddsregler för standardgrenen för att upprätthålla kvalitetskrav.

source: ComplianceStandardsAdherence|Set up branch protection rules to restrict push and merge access to protected branches.
sv: ComplianceStandardsAdherence|Konfigurera skyddsregler för att begränsa uppskicks- och sammanfogningsåtkomst till skyddade grenar.

source: ComplianceStandardsAdherence|Set up code owners
sv: ComplianceStandardsAdherence|Konfigurera kodägare

source: ServiceAccounts|No service accounts
sv: ServiceAccounts|Inga tjänstekonton

source: MergeRequest|Viewed by me
sv: MergeRequest|Visad av mig

source: Credentials stored in Amazon Q are valid and functioning correctly.
sv: Autentiseringsuppgifterna som lagras i Amazon Q är giltiga och fungerar korrekt.

source: CICD|Pipelines triggered by composite identities, including AI agents, run automatically without review or manual interaction.
sv: CICD|Pipelines som utlöses av sammansatta identiteter, inklusive AI-agenter, körs automatiskt utan granskning eller manuell interaktion.

source: CICD|Run pipelines triggered by AI agents automatically
sv: CICD|Kör pipelines som utlöses av AI-agenter automatiskt

source: NamespaceStorageSize|When a project reaches 100%% of the %{storage_docs_link_start}allocated storage%{link_end} (%{free_size_limit}) it will be placed in a read-only state. You won't be able to push and add large files to your repository.
sv: NamespaceStorageSize|När ett projekt når 100%% av det %{storage_docs_link_start}tilldelade lagringsutrymmet%{link_end} (%{free_size_limit}) försätts det i skrivskyddat läge. Du kommer inte att kunna skicka upp eller lägga till stora filer i ditt kodförråd.

source: BroadcastMessages|Broadcast messages must not contain sensitive information. All broadcast messages are publicly accessible through the API, regardless of path or role scoping.
sv: BroadcastMessages|Sändningsmeddelanden får inte innehålla känslig information. Alla sändningsmeddelanden är offentligt tillgängliga via API:t, oavsett sökväg eller rollavgränsning.

source: ComplianceStandardsAdherence|Ensures that merge requests require at least one approval before merging.
sv: ComplianceStandardsAdherence|Säkerställer att sammanfogningsbegäranden kräver minst ett godkännande före sammanfogning.

source: ComplianceStandardsAdherence|Create a fork of the project.
sv: ComplianceStandardsAdherence|Skapa en förgrening av projektet.

source: ComplianceStandardsAdherence|Ensures that a Git repository exists for the project.
sv: ComplianceStandardsAdherence|Säkerställer att det finns ett Git-arkiv för projektet.

source: ComplianceStandardsAdherence|Ensures that code owners file is configured.
sv: ComplianceStandardsAdherence|Säkerställer att filen med kodägare är konfigurerad.

source: ComplianceStandardsAdherence|Ensures that project contains protected branches.
sv: ComplianceStandardsAdherence|Säkerställer att projektet innehåller skyddade grenar.

source: ComplianceStandardsAdherence|Ensures that signed commits are required
sv: ComplianceStandardsAdherence|Säkerställer att signerade incheckningar krävs

source: ComplianceStandardsAdherence|Ensures that the project has been forked.
sv: ComplianceStandardsAdherence|Säkerställer att projektet har förgrenats.

source: ComplianceStandardsAdherence|Ensures that project is not archived.
sv: ComplianceStandardsAdherence|Säkerställer att projektet inte är arkiverat.

source: ComplianceStandardsAdherence|Ensures that project is not marked for deletion.
sv: ComplianceStandardsAdherence|Säkerställer att projektet inte är markerat för borttagning.

source: ServiceAccounts|Add service account
sv: ServiceAccounts|Lägg till tjänstekonto

source: ServiceAccounts|Manage access tokens
sv: ServiceAccounts|Hantera åtkomsttoken

source: ServiceAccounts|Personal access tokens
sv: ServiceAccounts|Personliga åtkomsttoken

source: ServiceAccounts|Service accounts
sv: ServiceAccounts|Tjänstekonton

source: DeployTokens|Allows read-only access to container images through the dependency proxy and read-only access to virtual registries.
sv: DeployTokens|Tillåter skrivskyddad åtkomst till containeravbildningar via beroendeproxyn och skrivskyddad åtkomst till virtuella register.

source: LDAP|Group cn
sv: LDAP|Grupp-CN

source: LDAP|User filter
sv: LDAP|Användarfilter

source: LDAP|Start typing
sv: LDAP|Börja skriva

source: LDAP|View more information on %{linkStart}user filters%{linkEnd}.
sv: LDAP|Visa mer information om %{linkStart}användarfilter%{linkEnd}.

source: AdminUsers|This user's access level is managed with LDAP. Remove user's mapping or change group's role in %{linkStart}LDAP synchronization%{linkEnd} to modify access.
sv: AdminUsers|Den här användarens åtkomstnivå hanteras med LDAP. Ta bort användarens koppling eller ändra gruppens roll i %{linkStart}LDAP-synkronisering%{linkEnd} för att ändra åtkomsten.

source: LDAP|Could not fetch LDAP groups. Please try again.
sv: LDAP|Det gick inte att hämta LDAP-grupper. Försök igen.

source: LDAP|Select LDAP group
sv: LDAP|Välj LDAP-grupp

source: LDAP|Custom admin role
sv: LDAP|Anpassad administratörsroll

source: LDAP|Select a server to fetch groups.
sv: LDAP|Välj en server för att hämta grupper.

source: MergeRequest|Allow merge request pipelines to access protected variables and runners
sv: MergeRequest|Tillåt att pipelines för sammanfogningsbegäranden får åtkomst till skyddade variabler och körare

source: MergeRequest|Control access to protected variables and runners in merge request pipelines
sv: MergeRequest|Styr åtkomsten till skyddade variabler och körare i pipelines för sammanfogningsbegäranden

source: ScanResultPolicy|If your DevOps Team frequently needs to push infrastructure configuration changes that trigger policy violations but are pre-approved through your change management process, add the DevOps Team group to bypass infrastructure policies.
sv: ScanResultPolicy|Om ditt DevOps-team ofta behöver skicka upp ändringar i infrastrukturkonfigurationen som utlöser policyöverträdelser men som redan har förhandsgodkänts genom er ändringshanteringsprocess, lägg till gruppen DevOps-team i undantagen för infrastrukturpolicyer.

source: LDAP|Ended at:
sv: LDAP|Avslutades:

source: LDAP|Last successful sync:
sv: LDAP|Senaste lyckade synkronisering:

source: LDAP|Never synced
sv: LDAP|Aldrig synkroniserad

source: LDAP|Started at:
sv: LDAP|Startade:

source: LDAP|Sync created at:
sv: LDAP|Synkronisering skapad:

source: LDAP|Sync error:
sv: LDAP|Synkroniseringsfel:

source: LDAP|Total runtime:
sv: LDAP|Total körtid:

source: DastProfiles|Set to `false` to disable caching. Default: `true`. **Note**: Disabling cache can cause OOM events or DAST job timeouts.
sv: DastProfiles|Ange `false` för att inaktivera cachelagring. Standardvärdet är `true`. **Obs!** Att inaktivera cachelagring kan orsaka OOM-händelser eller tidsgränser för DAST-jobb.

source: CICD|Allow pipeline variables by default
sv: CICD|Tillåt pipelinevariabler som standard

source: CICD|Control whether pipeline variables are allowed by default in new projects in new groups.
sv: CICD|Styr om pipelinevariabler tillåts som standard i nya projekt i nya grupper.

source: ComplianceStandardsAdherence|Ensures license compliance scanning is configured and running in the project's default branch pipeline.
sv: ComplianceStandardsAdherence|Säkerställer att licensgranskning är konfigurerad och körs i standardgrenens pipeline för projektet.

source: ComplianceStandardsAdherence|Ensures secret detection scanning is configured and running in the project's default branch pipeline.
sv: ComplianceStandardsAdherence|Säkerställer att hemlighetsidentifiering är konfigurerad och körs i standardgrenens pipeline för projektet.

source: Authenticated Git HTTP rate limit period in seconds
sv: Tidsperiod i sekunder för hastighetsbegränsning av autentiserad Git HTTP

source: Authenticated Git HTTP request rate limit
sv: Hastighetsbegränsning för autentiserade Git HTTP-begäranden

source: ComplianceStandardsAdherence|%{failedCount} failed
sv: ComplianceStandardsAdherence|%{failedCount} misslyckades

source: DastProfiles|Set the default level for the file log. See [SECURE_LOG_LEVEL](%{documentation_link}).
sv: DastProfiles|Ange standardnivån för filloggen. Se [SECURE_LOG_LEVEL](%{documentation_link}).

source: IncidentManagement|Paging status
sv: IncidentManagement|Larmstatus

source: CredentialsInventory|Owner type
sv: CredentialsInventory|Ägartyp

source: BulkImport|Please re-enter your credentials to reconnect.
sv: BulkImport|Ange dina autentiseringsuppgifter igen för att återansluta.

source: DastProfiles|A selector describing the element that is clicked on to submit the OTP form when it is separate from the username.
sv: DastProfiles|En väljare som beskriver elementet som klickas för att skicka OTP-formuläret när det är skilt från användarnamnet.

source: DastProfiles|OTP field
sv: DastProfiles|OTP-fält

source: DastProfiles|OTP secret key
sv: DastProfiles|OTP-hemlig nyckel

source: DastProfiles|OTP submit field
sv: DastProfiles|OTP-inskickningsfält

source: Members|Groups require a human Owner. Assign another human user as Owner to leave.
sv: Members|Grupper kräver en mänsklig ägare. Tilldela en annan mänsklig användare som ägare för att lämna gruppen.

source: SAML|Please, reload the page and sign in again, if necessary. To avoid data loss, if you have unsaved edits, dismiss the modal and copy the unsaved text before refreshing the page.
sv: SAML|Ladda om sidan och logga in igen vid behov. Om du har osparade ändringar bör du stänga dialogrutan och kopiera den osparade texten före uppdateringen för att undvika dataförlust.

source: ServiceAccount|Group ID provided does not match the service account's group ID.
sv: ServiceAccount|Angivet grupp-ID stämmer inte överens med tjänstekontots grupp-ID.

source: ServiceAccount|Group with the provided ID not found.
sv: ServiceAccount|Gruppen med angivet ID hittades inte.

source: ServiceAccount|User does not have permission to update a service account.
sv: ServiceAccount|Användaren har inte behörighet att uppdatera ett tjänstekonto.

source: ServiceAccount|User is not a service account
sv: ServiceAccount|Användaren är inte ett tjänstekonto

source: ResourceAccessTokensInstanceSettings|Defines how long, in days, to wait before deleting inactive project and group access tokens. If blank, inactive project and group access tokens are not deleted.
sv: ResourceAccessTokensInstanceSettings|Anger hur länge, i dagar, systemet väntar innan inaktiva åtkomsttoken för projekt och grupper tas bort. Om fältet är tomt tas inaktiva åtkomsttoken för projekt och grupper inte bort.

source: ResourceAccessTokensInstanceSettings|Inactive project and group access token retention period
sv: ResourceAccessTokensInstanceSettings|Lagringsperiod för inaktiva åtkomsttoken för projekt och grupper

source: ServiceAccounts|%{email} - unconfirmed
sv: ServiceAccounts|%{email} – obekräftad
